Revit 2027 API
BuiltInFailures.FabricSheetFailures.FabricSheetOutSideOfHostWarning Property
 Fabric Sheet is placed completely outside of its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricSheetOutSideOfHostWarning { get; }
Public Shared ReadOnly Property FabricSheetOutSideOfHostWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricSheetOutSideOfHostWarning {
	FailureDefinitionId^ get ();
}
static member FabricSheetOutSideOfHostWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricSheetFailures Class
Autodesk.Revit.DB Namespace